Revit 2027 API
BuiltInFailures.ConversionFailures.CannotConvertToDouble Property
 Cannot convert '[Text] ' to double value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotConvertToDouble { get; }
Public Shared ReadOnly Property CannotConvertToDouble As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotConvertToDouble {
	FailureDefinitionId^ get ();
}
static member CannotConvertToDouble : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConversionFailures Class
Autodesk.Revit.DB Namespace